//
//  Questions.swift
//  Prombezopasnost
//
//  Created by Altyn Dmitry on 27/01/2019.
//  Copyright © 2019 Altyn Dmitry. All rights reserved.
//

import Foundation

// задаем вопросы
let voprosiArray = ["вопрос 1?", "вопрос 2?", "вопрос 3?", "вопрос 4?","вопрос 5?"]
//TODO: создать динамичекий массив, подгрузку вопросов

// ответы
let otvetiArray = [["ответ 1.1", "ответ 1.2", "ответ 1.3", "ответ 1.4", "ответ 1.5",],["ответ 2.1", "ответ 2.2", "ответ 2.3", "ответ 2.4", ""],["ответ 3.1", "ответ 3.2", "ответ 3.3", "", ""],["ответ 4.1", "ответ 4.2", "", "", ""],["ответ 5.1", "", "", "", ""]]
//TODO: создать динамичекий массив, подгрузку ответов

let pravelniyOtvetIndexArray = [3,2,1,2,3]
//TODO: создать динмаичекий массив, подгрузку индекса правильного ответов

var vibraniyOtvetArray = [0,0,0,0,0,0] //
//TODO: создать динмаичекий массив, подгрузку ячеек на 1 больше чем вопросов

//struct Questions {
//    let question
//}
